title: Log4j RCE CVE-2021-44228 Generic
id: 5ea8faa8-db8b-45be-89b0-151b84c82702
status: test
description: Detects exploitation attempt against log4j RCE vulnerability reported as CVE-2021-44228 (Log4Shell)
references:
    - https://www.lunasec.io/docs/blog/log4j-zero-day/
    - https://news.ycombinator.com/item?id=29504755
    - https://github.com/tangxiaofeng7/apache-log4j-poc
    - https://gist.github.com/Neo23x0/e4c8b03ff8cdf1fa63b7d15db6e3860b
    - https://github.com/YfryTchsGD/Log4jAttackSurface
    - https://twitter.com/shutingrz/status/1469255861394866177?s=21
author: Florian Roth (Nextron Systems)
date: 2021/12/10
modified: 2022/02/06
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: webserver
detection:
    selection:
        CommandLine: 
            - '"C:\Windows\system32\mmc.exe" "C:\Windows\system32\eventvwr.msc" /s'
        EventID: 
            - 1
        ParentImage:
            - 'C:\Windows\explorer.exe'
        ParentCommandLine:
            - 'C:\Windows\Explorer.EXE'
        Image: 
            - 'C:\Windows\System32\mmc.exe'
    condition: selection
falsepositives:
    - Vulnerability scanning
level: high