title: 
status: experimental
description: ''
date: 2023-03-01
references:
    - Internal Research
author: 
logsource:
    product: windows
detection:
    selection:
        CommandLine: 'C:\Windows\system32\GWX\GWXConfigManager.exe /RefreshConfig'
        EventID: 4688
        NewProcessName: 'C:\Windows\System32\GWX\GWXConfigManager.exe'
        TokenElevationType: '%%1936'
        SubjectUserSid: 'S-1-5-18'
    condition: selection
falsepositives:
    - Unknown
level: 
